In [1]:
import pandas as pd

df = pd.read_csv('income_data.csv')
df

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
2   Vats  Female              43150.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
6   Shah    Male              55000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [2]:
df.groupby(['Name'])['MonthlyIncome (Rs.)'].sum()

Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome (Rs.), dtype: float64

In [3]:
df.groupby(['Name'])['MonthlyIncome (Rs.)'].max()

Name
Kumar    103000.0
Shah     114000.0
Vats     155000.0
Name: MonthlyIncome (Rs.), dtype: float64

In [4]:
df[df['MonthlyIncome (Rs.)'] > 60000]

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [5]:
df[df['Name'] == 'Shah']['MonthlyIncome (Rs.)'].mean()

93800.0